Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.et-se.tmx
Source language: et
Languages: se

source: Töökeskkonna amet on nn. kontaktbüroo, mis tegeleb lähetatud töötajatega seotud küsimustega.
se: Läs mer på Försäkringskassans webbplats, www.forsakringskassan.se.

source: Siit saad teavet selle kohta, millised on Sinu õigused.
se: Inkomsterna är skattefria under förutsättning att arbetet inte överskrider 183 dagar under en ettårsperiod.

source: Välisministeerium
se: Utrikesdepartementet
